#### RailSupportJustification Enumeration

---

|  |
| --- |
| See Also |

The justification of the rail supports.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum RailSupportJustification ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RailSupportJustification ``` |

| Visual C++ |
| --- |
| ``` public enum class RailSupportJustification ``` |

# Members

| Member name | Description |
| --- | --- |
| Begin | Supports are justified to the beginning of the rail. |
| Center | Supports are justified to the center of the rail. |
| End | Supports are justified to the end of the rail. |

# See Also

Autodesk.Revit.DB.Architecture Namespace